Tekla.Structures.Model.Internal.WorkPlaneChanger
The Tekla.Structures.Model.Internal.WorkPlaneChanger class provides a thread-safe implementation for operations that require temporary custom work plane.

Tekla.Structures.Model.Internal.WorkPlaneChanger.SyncObject
The synchronize object.

Tekla.Structures.Model.Internal.WorkPlaneChanger.oldWorkPlane
The old work plane.

Tekla.Structures.Model.Internal.WorkPlaneChanger.#ctor(Tekla.Structures.Model.TransformationPlane)
Initializes a new instance of the Tekla.Structures.Model.Internal.WorkPlaneChanger class.
plane: The plane.

Tekla.Structures.Model.Internal.WorkPlaneChanger.#ctor
Initializes a new instance of the Tekla.Structures.Model.Internal.WorkPlaneChanger class using global work plane.

Tekla.Structures.Model.Internal.WorkPlaneChanger.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.